{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "Usama_Yaseen_CV.pdf",
  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I have <span class='underline'>3+ years of experience</span> developing systems, interfaces, bots, and technological solutions to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular</span> applying good practices and development standards.",
  "Banner.ActionBtn": "Get in touch",
  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "In my <span class='underline'> 3+ years as a frontend developer</span>, I seek to train every day. I have worked on a variety of projects, <span class='underline'>performing continuous integration</span>. I have led teams having empathy, exercising motivation to partners, and setting plans and goals together.",
    "My skills also include implementing system improvements, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Techset Solution",
      "Title": "Senior Angular Developer",
      "Date": "September 2024 - Present",
      "jobIntro": "At Techset, I progressed from a Senior Developer to a Small Team Lead:",
      "Description": [
        "Managed client communications, coordinated meetings, and handled project management responsibilities to ensure seamless project execution.",
        "Led development efforts using Angular and integrated thirdparty services for multiple projects, contributing extensive technical expertise.",
        "Promoted a collaborative work environment by mentoring junior developers and working closely with cross-functional teams. This role sharpened my management skills, enhanced my ability to interact with clients, and deepened my expertise in modern web development technologies."
      ]
    },
    {
      "Tab": "Codeteck",
      "Title": "Angular Developer",
      "Date": "March 2022 - September 2024",
      "jobIntro": "After completing my internship at Codeteck, I contributed to multiple products, taking ownership of one of them:",
      "Description": [
        "Key projects include Orange Traders (with templates) & Zepiex.",
        "My responsibilities involved working on frontend development, UI tasks, and integrating external systems.",
        "I was actively involved in API implementation, utilizing reactive forms, and handling CRUD operations.",
        "I also integrated third-party services and collaborated with the team to ensure smooth project execution.",
        "I participated in client demos, presenting features and functionality.",
        "Additionally, I worked extensively with asynchronous programming using async/await, promises, and callbacks, while integrating APIs.",
        "As part of my work, I implemented Stripe payment integration and integrated a chat system (similar to WhatsApp) using Socket.io."
      ]
    }
  ],
  "FeatureProjects.Title": "Projects that I was a part of",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [],
  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
  "Contact.Btn": "Say Hello"
}
